# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap "buo/cask-upgrade"

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew "github-keygen"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "oh-my-posh"
brew "wget"
brew "eza" # exa/ls replacement

# Development
brew 'imagemagick'

# Apps
cask 'tuple'
cask "itsycal"
cask "aldente"
cask "rectangle"
cask "appcleaner"
cask "firefox@nightly"
cask "visual-studio-code@insiders"
cask "keka"
cask "suspicious-package"
cask "iterm2"
cask "spacedrive"
cask "discord@canary"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
